test/3DLidDrivenCavity/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    down
    {
        type            patch;
        nFaces          20;
        startFace       760;
    }
    right
    {
        type            patch;
        nFaces          20;
        startFace       780;
    }
    movingTop
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       800;
    }
    left
    {
        type            patch;
        nFaces          20;
        startFace       820;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          800;
        startFace       840;
    }
)

// ************************************************************************* //
